tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "microsoft/git"

brew "coreutils"
# Install some other useful utilities like `sponge`.
brew "moreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"
# Install a modern version of Bash.
brew "bash"
brew "bash-completion@2"

# Install `wget`
brew "wget"

# Install GnuPG to enable PGP-signing commits.
brew "gnupg"
brew "pinentry-mac"

# Install more recent versions of some macOS tools.
brew "neovim"
brew "grep"
brew "openssh"
brew "screen"
brew "gmp"

# Productivity tools
brew "awscli"
brew "fx"
brew "fzf"
brew "git"
brew "go-task/tap/go-task"
brew "helm"
brew "httpie"
brew "jq"
brew "lolcat"
brew "mas"
brew "ripgrep"
brew "yq"

# Shell tools
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Casks
cask "alfred"
cask "karabiner-elements"
cask "kitty"
cask "slack"
cask "visualvm"
cask "visual-studio-code-insiders"
cask "git-credential-manager-core"
cask "brave-browser"

#  Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"

# Mac App Store

mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694