tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "buo/cask-upgrade"
tap "microsoft/git"

brew "coreutils"
# Install some other useful utilities like `sponge`.
brew "moreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"
# Install a modern version of Bash.
brew "bash"
brew "bash-completion@2"

# Install `wget`
brew "wget"

# Install GnuPG to enable PGP-signing commits.
brew "gnupg"
brew "pinentry-mac"

# MacOS version of tree
brew "tree"

# Install more recent versions of some macOS tools.
brew "neovim"
brew "grep"
brew "openssh"
brew "screen"
brew "gmp"

# Productivity tools
brew "awscli"
brew "cowsay"
brew "fx"
brew "fzf"
brew "git"
brew "go-task/tap/go-task"
brew "helm"
brew "httpie"
brew "jq"
brew "lolcat"
brew "mas"
brew "ripgrep"
brew "svn"
brew "yq"
brew "terraform"

# Kubernetes tools
brew "kubectl"
brew "kubectx"
brew "minikube"
brew "operator-sdk"

# https://github.com/abiosoft/colima
brew "colima" 
brew "docker"
brew "docker-compose"

# Python
brew "pyenv"
brew "pyenv-virtualenv"

# Node
brew "nvm"

# Kubernetes Operator development
brew "operator-sdk"

# Shell tools
# brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew "bitwarden-cli"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Casks
cask "bartender"
cask "cleanmymac"
cask "confluent-cli"
cask "firefox-developer-edition"
cask "figma"
cask "git-credential-manager-core"
cask "hammerspoon"
cask "intellij-idea"
cask "karabiner-elements"
cask "kitty"
cask "notion"
cask "raycast"
cask "slack"
cask "spotify"
cask "visual-studio-code-insiders"
cask "visualvm"

# 3D Printing
cask "prusaslicer"
cask "blender"

#  Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "The Unarchiver", id: 425424353
mas "Numbers", id: 409203825