<?xml version="1.0" encoding="UTF-8"?>
<packages>
  <package id="7zip" />
  <package id="autohotkey" />
  <package id="ChocolateyGUI"/>
  <package id="firacode-ttf" />
  <package id="Firefox" />
  <package id="git" packageParameters="/NoShellIntegration /NoAutoCrlf /SChannel /WindowsTerminal" />
  <package id="go-task" />
  <package id="JetBrainsMonoNF" />
  <package id="jetbrainstoolbox" />
  <package id="obsidian"/>
  <package id="powershell-core" />
  <package id="python3" />
  <package id="slack" />
  <package id="starship" />
  <package id="vscode" />
</packages>
