tap "buo/cask-upgrade"
tap "microsoft/git"

brew "wget"
brew "gnupg"
brew "neovim"
brew "openssh"
brew "sshs"
brew "screen"
brew "gmp"
brew "fzf"
brew "navi"
brew "ag"
brew "maven"
brew "keychain"
brew "k9s"
brew "eza"
brew "gh"
brew "docker"

# Misc util collections
brew "coreutils"
brew "moreutils"
brew "findutils"

# modern replacements
# some of these are aliased in zsh-alias
brew "gping" # modern replacement for 'ping'
brew "bottom" # modern replacement for 'top'
brew "ripgrep" # modern replacement for 'grep'

# git (mainly for updates)
brew "git"
brew "pre-commit"

# Oracle Cloud Infrastructure
brew "oci-cli"

brew "starship"
brew "terraform"
brew "jq"

# version management
brew "asdf"

# kafka
brew "kafka"

# kubernetes
# kubectl and helm are downloaded with asdf
# brew "k3d"

# taskfile support
brew "just"
brew "go-task"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

cask "git-credential-manager-core"
cask "visual-studio-code"

#  Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
